ClearDotX/TRK-KEA8_128/LINStack/Examples/S12ZVML31_example/Obidos_S12ZVML31/S12ZVML31_LIN_Master/Project_Headers/mc9s12zvml31.h
/*** PMFICCTL - PMF Internal Correction Control Register; 0x0000051E ***/
typedef union {
  byte Byte;
  struct {
    byte ICCA        :1;                                       /* Internal Correction Control */
    byte ICCB        :1;                                       /* Internal Correction Control */
    byte ICCC        :1;                                       /* Internal Correction Control */
    byte PECA        :1;                                       /* Pulse Edge Control */
    byte PECB        :1;                                       /* Pulse Edge Control */
    byte PECC        :1;                                       /* Pulse Edge Control */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpICCx :3;
    byte grpPECx :3;
    byte         :1;
    byte         :1;
  } MergedBits;
} PMFICCTLSTR;
extern volatile PMFICCTLSTR _PMFICCTL @0x0000051E;
#define PMFICCTL                        _PMFICCTL.Byte
#define PMFICCTL_ICCA                   _PMFICCTL.Bits.ICCA
#define PMFICCTL_ICCB                   _PMFICCTL.Bits.ICCB
#define PMFICCTL_ICCC                   _PMFICCTL.Bits.ICCC
#define PMFICCTL_PECA                   _PMFICCTL.Bits.PECA
#define PMFICCTL_PECB                   _PMFICCTL.Bits.PECB
#define PMFICCTL_PECC                   _PMFICCTL.Bits.PECC
#define PMFICCTL_ICCx                   _PMFICCTL.MergedBits.grpICCx
#define PMFICCTL_PECx                   _PMFICCTL.MergedBits.grpPECx

#define PMFICCTL_ICCA_MASK              1U
#define PMFICCTL_ICCB_MASK              2U
#define PMFICCTL_ICCC_MASK              4U
#define PMFICCTL_PECA_MASK              8U
#define PMFICCTL_PECB_MASK              16U
#define PMFICCTL_PECC_MASK              32U
#define PMFICCTL_ICCx_MASK              7U
#define PMFICCTL_ICCx_BITNUM            0U
#define PMFICCTL_PECx_MASK              56U
#define PMFICCTL_PECx_BITNUM            3U


/*** PMFCINV - PMF Compare Invert Register; 0x0000051F ***/
typedef union {
  byte Byte;
  struct {
    byte CINV0       :1;                                       /* PWM Compare Invert 0 */
    byte CINV1       :1;                                       /* PWM Compare Invert 1 */
    byte CINV2       :1;                                       /* PWM Compare Invert 2 */
    byte CINV3       :1;                                       /* PWM Compare Invert 3 */
    byte CINV4       :1;                                       /* PWM Compare Invert 4 */
    byte CINV5       :1;                                       /* PWM Compare Invert 5 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpCINV :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} PMFCINVSTR;
extern volatile PMFCINVSTR _PMFCINV @0x0000051F;
#define PMFCINV                         _PMFCINV.Byte
#define PMFCINV_CINV0                   _PMFCINV.Bits.CINV0
#define PMFCINV_CINV1                   _PMFCINV.Bits.CINV1
#define PMFCINV_CINV2                   _PMFCINV.Bits.CINV2
#define PMFCINV_CINV3                   _PMFCINV.Bits.CINV3
#define PMFCINV_CINV4                   _PMFCINV.Bits.CINV4
#define PMFCINV_CINV5                   _PMFCINV.Bits.CINV5
#define PMFCINV_CINV                    _PMFCINV.MergedBits.grpCINV

#define PMFCINV_CINV0_MASK              1U
#define PMFCINV_CINV1_MASK              2U
#define PMFCINV_CINV2_MASK              4U
#define PMFCINV_CINV3_MASK              8U
#define PMFCINV_CINV4_MASK              16U
#define PMFCINV_CINV5_MASK              32U
#define PMFCINV_CINV_MASK               63U
#define PMFCINV_CINV_BITNUM             0U


/*** PMFENCA - PMF Enable Control A Register; 0x00000520 ***/
typedef union {
  byte Byte;
  struct {
    byte PWMRIEA     :1;                                       /* PWM Reload Interrupt Enable A */
    byte LDOKA       :1;                                       /* Load Okay A */
    byte RSTRTA      :1;                                       /* Restart Generator A */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte GLDOKA      :1;                                       /* Global Load Okay A */
    byte PWMENA      :1;                                       /* PWM Generator A Enable */
  } Bits;
} PMFENCASTR;
extern volatile PMFENCASTR _PMFENCA @0x00000520;
#define PMFENCA                         _PMFENCA.Byte
#define PMFENCA_PWMRIEA                 _PMFENCA.Bits.PWMRIEA
#define PMFENCA_LDOKA                   _PMFENCA.Bits.LDOKA
#define PMFENCA_RSTRTA                  _PMFENCA.Bits.RSTRTA
#define PMFENCA_GLDOKA                  _PMFENCA.Bits.GLDOKA
#define PMFENCA_PWMENA                  _PMFENCA.Bits.PWMENA

#define PMFENCA_PWMRIEA_MASK            1U
#define PMFENCA_LDOKA_MASK              2U
#define PMFENCA_RSTRTA_MASK             4U
#define PMFENCA_GLDOKA_MASK             64U
#define PMFENCA_PWMENA_MASK             128U


/*** PMFFQCA - PMF Frequency Control A Register; 0x00000521 ***/
typedef union {
  byte Byte;
  struct {
    byte PWMRFA      :1;                                       /* PWM Reload Flag A */
    byte PRSCA       :2;                                       /* Prescaler A */
    byte HALFA       :1;                                       /* Half Cycle Reload A */
    byte LDFQA       :4;                                       /* Load Frequency A */
  } Bits;
} PMFFQCASTR;
extern volatile PMFFQCASTR _PMFFQCA @0x00000521;
#define PMFFQCA                         _PMFFQCA.Byte
#define PMFFQCA_PWMRFA                  _PMFFQCA.Bits.PWMRFA
#define PMFFQCA_PRSCA                   _PMFFQCA.Bits.PRSCA
#define PMFFQCA_HALFA                   _PMFFQCA.Bits.HALFA
#define PMFFQCA_LDFQA                   _PMFFQCA.Bits.LDFQA

#define PMFFQCA_PWMRFA_MASK             1U
#define PMFFQCA_PRSCA_MASK              6U
#define PMFFQCA_PRSCA_BITNUM            1U
#define PMFFQCA_HALFA_MASK              8U
#define PMFFQCA_LDFQA_MASK              240U
#define PMFFQCA_LDFQA_BITNUM            4U


/*** PMFCNTA - PMF counter A Register; 0x00000522 ***/
typedef union {
  word Word;
  struct {
    word PMFCNTA_grp :15;                                      /* PMF counter */ /*Warning: group name is duplicated with register name*/
    word             :1; 
  } Bits;
} PMFCNTASTR;
extern volatile PMFCNTASTR _PMFCNTA @0x00000522;
#define PMFCNTA                         _PMFCNTA.Word
#define PMFCNTA_PMFCNTA                 _PMFCNTA.Bits.PMFCNTA_grp

#define PMFCNTA_PMFCNTA_MASK            32767U
#define PMFCNTA_PMFCNTA_BITNUM          0U


