ClearDotX/TRK-KEA8_128/LINStack/Examples/S12ZVML31_example/Obidos_S12ZVML31/S12ZVML31_LIN_Master/Project_Headers/mc9s12zvml31.h
#define ADC0CROFF0_CMDRES_OFF0_MASK     127U
#define ADC0CROFF0_CMDRES_OFF0_BITNUM   0U


/*** ADC0CROFF1 - ADC0 Command and Result Offset Register 1; 0x00000625 ***/
typedef union {
  byte Byte;
  struct {
    byte CMDRES_OFF1 :7;                                       /* ADC Command and Result Offset Value refer to CSL_1 and RVL_1 */
    byte             :1; 
  } Bits;
} ADC0CROFF1STR;
extern volatile ADC0CROFF1STR _ADC0CROFF1 @0x00000625;
#define ADC0CROFF1                      _ADC0CROFF1.Byte
#define ADC0CROFF1_CMDRES_OFF1          _ADC0CROFF1.Bits.CMDRES_OFF1

#define ADC0CROFF1_CMDRES_OFF1_MASK     127U
#define ADC0CROFF1_CMDRES_OFF1_BITNUM   0U


/*** ADC1CTL - ADC1 Control Register; 0x00000640 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ADC1CTL_0 - ADC1 Control Register 0; 0x00000640 ***/
    union {
      byte Byte;
      struct {
        byte MOD_CFG     :1;                                       /* Trigger Mode Configuration */
        byte STR_SEQA    :1;                                       /* Control Of Conversion Result Storage and RSTAR_EIF flag setting at Sequence Abort or Restart Event */
        byte ACC_CFG     :2;                                       /* ADCFLWCTL Register Access Configuration */
        byte SWAI        :1;                                       /* Wait Mode Configuration */
        byte FRZ_MOD     :1;                                       /* Freeze Mode Configuration */
        byte ADC_SR      :1;                                       /* ADC Soft Reset */
        byte ADC_EN      :1;                                       /* ADC Enable Bit */
      } Bits;
    } ADC1CTL_0STR;
    #define ADC1CTL_0                   _ADC1CTL.Overlap_STR.ADC1CTL_0STR.Byte
    #define ADC1CTL_0_MOD_CFG           _ADC1CTL.Overlap_STR.ADC1CTL_0STR.Bits.MOD_CFG
    #define ADC1CTL_0_STR_SEQA          _ADC1CTL.Overlap_STR.ADC1CTL_0STR.Bits.STR_SEQA
    #define ADC1CTL_0_ACC_CFG           _ADC1CTL.Overlap_STR.ADC1CTL_0STR.Bits.ACC_CFG
    #define ADC1CTL_0_SWAI              _ADC1CTL.Overlap_STR.ADC1CTL_0STR.Bits.SWAI
    #define ADC1CTL_0_FRZ_MOD           _ADC1CTL.Overlap_STR.ADC1CTL_0STR.Bits.FRZ_MOD
    #define ADC1CTL_0_ADC_SR            _ADC1CTL.Overlap_STR.ADC1CTL_0STR.Bits.ADC_SR
    #define ADC1CTL_0_ADC_EN            _ADC1CTL.Overlap_STR.ADC1CTL_0STR.Bits.ADC_EN
    /* ADC1CTL__ARR: Access 2 ADC1CTL_x registers in an array */
    #define ADC1CTL__ARR                ((volatile byte *) &ADC1CTL_0)
    
    #define ADC1CTL_0_MOD_CFG_MASK      1U
    #define ADC1CTL_0_STR_SEQA_MASK     2U
    #define ADC1CTL_0_ACC_CFG_MASK      12U
    #define ADC1CTL_0_ACC_CFG_BITNUM    2U
    #define ADC1CTL_0_SWAI_MASK         16U
    #define ADC1CTL_0_FRZ_MOD_MASK      32U
    #define ADC1CTL_0_ADC_SR_MASK       64U
    #define ADC1CTL_0_ADC_EN_MASK       128U
    

    /*** ADC1CTL_1 - ADC1 Control Register 1; 0x00000641 ***/
    union {
      byte Byte;
      struct {
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte AUT_RSTA    :1;                                       /* Automatic Restart Event after exit from MCU Stop and Wait Mode */
        byte SMOD_ACC    :1;                                       /* Special Mode Access Control */
        byte RVL_BMOD    :1;                                       /* RVL Buffer Mode Select */
        byte CSL_BMOD    :1;                                       /* CSL Buffer Mode Select */
      } Bits;
    } ADC1CTL_1STR;
    #define ADC1CTL_1                   _ADC1CTL.Overlap_STR.ADC1CTL_1STR.Byte
    #define ADC1CTL_1_AUT_RSTA          _ADC1CTL.Overlap_STR.ADC1CTL_1STR.Bits.AUT_RSTA
    #define ADC1CTL_1_SMOD_ACC          _ADC1CTL.Overlap_STR.ADC1CTL_1STR.Bits.SMOD_ACC
    #define ADC1CTL_1_RVL_BMOD          _ADC1CTL.Overlap_STR.ADC1CTL_1STR.Bits.RVL_BMOD
    #define ADC1CTL_1_CSL_BMOD          _ADC1CTL.Overlap_STR.ADC1CTL_1STR.Bits.CSL_BMOD
    
    #define ADC1CTL_1_AUT_RSTA_MASK     16U
    #define ADC1CTL_1_SMOD_ACC_MASK     32U
    #define ADC1CTL_1_RVL_BMOD_MASK     64U
    #define ADC1CTL_1_CSL_BMOD_MASK     128U
    
  } Overlap_STR;

  struct {
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word AUT_RSTA    :1;                                       /* Automatic Restart Event after exit from MCU Stop and Wait Mode */
    word SMOD_ACC    :1;                                       /* Special Mode Access Control */
    word RVL_BMOD    :1;                                       /* RVL Buffer Mode Select */
    word CSL_BMOD    :1;                                       /* CSL Buffer Mode Select */
    word MOD_CFG     :1;                                       /* Trigger Mode Configuration */
    word STR_SEQA    :1;                                       /* Control Of Conversion Result Storage during Sequence abort (SEQA) or Restart request (RSTA) */
    word ACC_CFG     :2;                                       /* ADCFLWCTL Register Access Configuration */
    word SWAI        :1;                                       /* Wait Mode Configuration */
    word FRZ_MOD     :1;                                       /* Freeze Mode Configuration */
    word ADC_SR      :1;                                       /* ADC Soft Reset */
    word ADC_EN      :1;                                       /* ADC Enable Bit */
  } Bits;
} ADC1CTLSTR;
extern volatile ADC1CTLSTR _ADC1CTL @0x00000640;
#define ADC1CTL                         _ADC1CTL.Word
#define ADC1CTL_AUT_RSTA                _ADC1CTL.Bits.AUT_RSTA
#define ADC1CTL_SMOD_ACC                _ADC1CTL.Bits.SMOD_ACC
#define ADC1CTL_RVL_BMOD                _ADC1CTL.Bits.RVL_BMOD
#define ADC1CTL_CSL_BMOD                _ADC1CTL.Bits.CSL_BMOD
#define ADC1CTL_MOD_CFG                 _ADC1CTL.Bits.MOD_CFG
#define ADC1CTL_STR_SEQA                _ADC1CTL.Bits.STR_SEQA
#define ADC1CTL_ACC_CFG                 _ADC1CTL.Bits.ACC_CFG
#define ADC1CTL_SWAI                    _ADC1CTL.Bits.SWAI
#define ADC1CTL_FRZ_MOD                 _ADC1CTL.Bits.FRZ_MOD
#define ADC1CTL_ADC_SR                  _ADC1CTL.Bits.ADC_SR
#define ADC1CTL_ADC_EN                  _ADC1CTL.Bits.ADC_EN

