ClearDotX/TRK-KEA8_128/LINStack/Examples/S12ZVML31_example/Obidos_S12ZVML31/S12ZVML31_LIN_Master/Project_Headers/mc9s12zvml31.h
#define ADC1CTL_AUT_RSTA_MASK           16U
#define ADC1CTL_SMOD_ACC_MASK           32U
#define ADC1CTL_RVL_BMOD_MASK           64U
#define ADC1CTL_CSL_BMOD_MASK           128U
#define ADC1CTL_MOD_CFG_MASK            256U
#define ADC1CTL_STR_SEQA_MASK           512U
#define ADC1CTL_ACC_CFG_MASK            3072U
#define ADC1CTL_ACC_CFG_BITNUM          10U
#define ADC1CTL_SWAI_MASK               4096U
#define ADC1CTL_FRZ_MOD_MASK            8192U
#define ADC1CTL_ADC_SR_MASK             16384U
#define ADC1CTL_ADC_EN_MASK             32768U


/*** ADC1STS - ADC1 Status Register; 0x00000642 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte READY       :1;                                       /* Flag indicates that ADC is in its idle state and ready for a Restart Event */
    byte             :1; 
    byte DBECC_ERR   :1;                                       /* Double Bit ECC Error Flag */
    byte RVL_SEL     :1;                                       /* Result Value List Select */
    byte CSL_SEL     :1;                                       /* Command Sequence List Select */
  } Bits;
} ADC1STSSTR;
extern volatile ADC1STSSTR _ADC1STS @0x00000642;
#define ADC1STS                         _ADC1STS.Byte
#define ADC1STS_READY                   _ADC1STS.Bits.READY
#define ADC1STS_DBECC_ERR               _ADC1STS.Bits.DBECC_ERR
#define ADC1STS_RVL_SEL                 _ADC1STS.Bits.RVL_SEL
#define ADC1STS_CSL_SEL                 _ADC1STS.Bits.CSL_SEL

#define ADC1STS_READY_MASK              8U
#define ADC1STS_DBECC_ERR_MASK          32U
#define ADC1STS_RVL_SEL_MASK            64U
#define ADC1STS_CSL_SEL_MASK            128U


/*** ADC1TIM - ADC1 Timing Register; 0x00000643 ***/
typedef union {
  byte Byte;
  struct {
    byte PRS         :7;                                       /* ADC Clock Prescaler */
    byte             :1; 
  } Bits;
} ADC1TIMSTR;
extern volatile ADC1TIMSTR _ADC1TIM @0x00000643;
#define ADC1TIM                         _ADC1TIM.Byte
#define ADC1TIM_PRS                     _ADC1TIM.Bits.PRS

#define ADC1TIM_PRS_MASK                127U
#define ADC1TIM_PRS_BITNUM              0U


/*** ADC1FMT - ADC1 Format Register; 0x00000644 ***/
typedef union {
  byte Byte;
  struct {
    byte SRES        :3;                                       /* ADC Resolution Select */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte DJM         :1;                                       /* Result Register Data Justification */
  } Bits;
} ADC1FMTSTR;
extern volatile ADC1FMTSTR _ADC1FMT @0x00000644;
#define ADC1FMT                         _ADC1FMT.Byte
#define ADC1FMT_SRES                    _ADC1FMT.Bits.SRES
#define ADC1FMT_DJM                     _ADC1FMT.Bits.DJM

#define ADC1FMT_SRES_MASK               7U
#define ADC1FMT_SRES_BITNUM             0U
#define ADC1FMT_DJM_MASK                128U


/*** ADC1FLWCTL - ADC1 Conversion Flow Control Register; 0x00000645 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte LDOK        :1;                                       /* Load OK for alternative Command Sequence List */
    byte RSTA        :1;                                       /* Restart Event (Restart from Top of Command Sequence List) */
    byte TRIG        :1;                                       /* Conversion Sequence Trigger */
    byte SEQA        :1;                                       /* Conversion Sequence Abort Event */
  } Bits;
} ADC1FLWCTLSTR;
extern volatile ADC1FLWCTLSTR _ADC1FLWCTL @0x00000645;
#define ADC1FLWCTL                      _ADC1FLWCTL.Byte
#define ADC1FLWCTL_LDOK                 _ADC1FLWCTL.Bits.LDOK
#define ADC1FLWCTL_RSTA                 _ADC1FLWCTL.Bits.RSTA
#define ADC1FLWCTL_TRIG                 _ADC1FLWCTL.Bits.TRIG
#define ADC1FLWCTL_SEQA                 _ADC1FLWCTL.Bits.SEQA

#define ADC1FLWCTL_LDOK_MASK            16U
#define ADC1FLWCTL_RSTA_MASK            32U
#define ADC1FLWCTL_TRIG_MASK            64U
#define ADC1FLWCTL_SEQA_MASK            128U


/*** ADC1EIE - ADC1 Error Interrupt Enable Register; 0x00000646 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte LDOK_EIE    :1;                                       /* Load OK Error Interrupt Enable */
    byte RSTAR_EIE   :1;                                       /* Restart Request Error Interrupt Enable */
    byte TRIG_EIE    :1;                                       /* Conversion Sequence Trigger Error Interrupt Enable */
    byte             :1; 
    byte EOL_EIE     :1;                                       /* End Of List Error Interrupt Enable */
    byte CMD_EIE     :1;                                       /* Command Value Error Interrupt Enable */
    byte IA_EIE      :1;                                       /* Illegal Access Error Interrupt Enable */
  } Bits;
} ADC1EIESTR;
extern volatile ADC1EIESTR _ADC1EIE @0x00000646;
#define ADC1EIE                         _ADC1EIE.Byte
#define ADC1EIE_LDOK_EIE                _ADC1EIE.Bits.LDOK_EIE
#define ADC1EIE_RSTAR_EIE               _ADC1EIE.Bits.RSTAR_EIE
#define ADC1EIE_TRIG_EIE                _ADC1EIE.Bits.TRIG_EIE
#define ADC1EIE_EOL_EIE                 _ADC1EIE.Bits.EOL_EIE
#define ADC1EIE_CMD_EIE                 _ADC1EIE.Bits.CMD_EIE
#define ADC1EIE_IA_EIE                  _ADC1EIE.Bits.IA_EIE

#define ADC1EIE_LDOK_EIE_MASK           2U
#define ADC1EIE_RSTAR_EIE_MASK          4U
#define ADC1EIE_TRIG_EIE_MASK           8U
#define ADC1EIE_EOL_EIE_MASK            32U
#define ADC1EIE_CMD_EIE_MASK            64U
#define ADC1EIE_IA_EIE_MASK             128U


/*** ADC1IE - ADC1 Interrupt Enable Register; 0x00000647 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte CONIF_OIE   :1;                                       /* ADCCONIF Register Flags Overrun Interrupt Enable */
    byte SEQAD_IE    :1;                                       /* Conversion Sequence Abort Done Interrupt Enable */
  } Bits;
} ADC1IESTR;
extern volatile ADC1IESTR _ADC1IE @0x00000647;
#define ADC1IE                          _ADC1IE.Byte
#define ADC1IE_CONIF_OIE                _ADC1IE.Bits.CONIF_OIE
#define ADC1IE_SEQAD_IE                 _ADC1IE.Bits.SEQAD_IE

#define ADC1IE_CONIF_OIE_MASK           64U
#define ADC1IE_SEQAD_IE_MASK            128U


/*** ADC1EIF - ADC1 Error Interrupt Flag Register; 0x00000648 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte LDOK_EIF    :1;                                       /* Load OK Error Interrupt Flag */
    byte RSTAR_EIF   :1;                                       /* Restart Request Error Interrupt Flag */
    byte TRIG_EIF    :1;                                       /* Trigger Error Interrupt Flag */
    byte             :1; 
    byte EOL_EIF     :1;                                       /* End Of List Error Interrupt Flag */
    byte CMD_EIF     :1;                                       /* Command Value Error Interrupt Flag */
    byte IA_EIF      :1;                                       /* Illegal Access Error Interrupt Flag */
  } Bits;
} ADC1EIFSTR;
extern volatile ADC1EIFSTR _ADC1EIF @0x00000648;
#define ADC1EIF                         _ADC1EIF.Byte
#define ADC1EIF_LDOK_EIF                _ADC1EIF.Bits.LDOK_EIF
#define ADC1EIF_RSTAR_EIF               _ADC1EIF.Bits.RSTAR_EIF
#define ADC1EIF_TRIG_EIF                _ADC1EIF.Bits.TRIG_EIF
#define ADC1EIF_EOL_EIF                 _ADC1EIF.Bits.EOL_EIF
#define ADC1EIF_CMD_EIF                 _ADC1EIF.Bits.CMD_EIF
#define ADC1EIF_IA_EIF                  _ADC1EIF.Bits.IA_EIF

