ClearDotX/TRK-KEA8_128/LINStack/Examples/S12ZVML31_example/Obidos_S12ZVML31/S12ZVML31_LIN_Master/Project_Headers/mc9s12zvml31.h
/*** GDUCLK1 - GDU Clock Control Register 1; 0x000006A7 ***/
typedef union {
  byte Byte;
  struct {
    byte GBODC       :2;                                       /* GDU Boost Option Clock Duty Cycle */
    byte GBOCD       :5;                                       /* GDU Boost Option Clock Divider */
    byte             :1; 
  } Bits;
} GDUCLK1STR;
extern volatile GDUCLK1STR _GDUCLK1 @0x000006A7;
#define GDUCLK1                         _GDUCLK1.Byte
#define GDUCLK1_GBODC                   _GDUCLK1.Bits.GBODC
#define GDUCLK1_GBOCD                   _GDUCLK1.Bits.GBOCD

#define GDUCLK1_GBODC_MASK              3U
#define GDUCLK1_GBODC_BITNUM            0U
#define GDUCLK1_GBOCD_MASK              124U
#define GDUCLK1_GBOCD_BITNUM            2U


/*** GDUBCL - GDU Boost Current Limit Register; 0x000006A8 ***/
typedef union {
  byte Byte;
  struct {
    byte GBCL        :4;                                       /* GDU Boost Current Limit Register */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} GDUBCLSTR;
extern volatile GDUBCLSTR _GDUBCL @0x000006A8;
#define GDUBCL                          _GDUBCL.Byte
#define GDUBCL_GBCL                     _GDUBCL.Bits.GBCL

#define GDUBCL_GBCL_MASK                15U
#define GDUBCL_GBCL_BITNUM              0U


/*** GDUPHMUX - GDU Phase Mux Register; 0x000006A9 ***/
typedef union {
  byte Byte;
  struct {
    byte GPHMX       :2;                                       /* GDU Phase Multplexer */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} GDUPHMUXSTR;
extern volatile GDUPHMUXSTR _GDUPHMUX @0x000006A9;
#define GDUPHMUX                        _GDUPHMUX.Byte
#define GDUPHMUX_GPHMX                  _GDUPHMUX.Bits.GPHMX

#define GDUPHMUX_GPHMX_MASK             3U
#define GDUPHMUX_GPHMX_BITNUM           0U


/*** GDUCSO - GDU Current Sense Offset Register; 0x000006AA ***/
typedef union {
  byte Byte;
  struct {
    byte GCSO0       :3;                                       /* GDU Current Sense Amplifier 0 Offset */
    byte             :1; 
    byte GCSO1       :3;                                       /* GDU Current Sense Amplifier 1 Offset */
    byte             :1; 
  } Bits;
} GDUCSOSTR;
extern volatile GDUCSOSTR _GDUCSO @0x000006AA;
#define GDUCSO                          _GDUCSO.Byte
#define GDUCSO_GCSO0                    _GDUCSO.Bits.GCSO0
#define GDUCSO_GCSO1                    _GDUCSO.Bits.GCSO1

#define GDUCSO_GCSO0_MASK               7U
#define GDUCSO_GCSO0_BITNUM             0U
#define GDUCSO_GCSO1_MASK               112U
#define GDUCSO_GCSO1_BITNUM             4U


/*** GDUDSLVL - GDU Desaturation Level Register; 0x000006AB ***/
typedef union {
  byte Byte;
  struct {
    byte GDSLLS      :3;                                       /* GDU Desaturation Level for Low-Side Drivers */
    byte GDSFLS      :1;                                       /* GDU Desaturation Filter Characteristic for Low-Side Drivers */
    byte GDSLHS      :3;                                       /* GDU Desaturation Level for High-Side Drivers */
    byte GDSFHS      :1;                                       /* GDU Desaturation Filter Characteristic for High-Side Drivers */
  } Bits;
} GDUDSLVLSTR;
extern volatile GDUDSLVLSTR _GDUDSLVL @0x000006AB;
#define GDUDSLVL                        _GDUDSLVL.Byte
#define GDUDSLVL_GDSLLS                 _GDUDSLVL.Bits.GDSLLS
#define GDUDSLVL_GDSFLS                 _GDUDSLVL.Bits.GDSFLS
#define GDUDSLVL_GDSLHS                 _GDUDSLVL.Bits.GDSLHS
#define GDUDSLVL_GDSFHS                 _GDUDSLVL.Bits.GDSFHS

#define GDUDSLVL_GDSLLS_MASK            7U
#define GDUDSLVL_GDSLLS_BITNUM          0U
#define GDUDSLVL_GDSFLS_MASK            8U
#define GDUDSLVL_GDSLHS_MASK            112U
#define GDUDSLVL_GDSLHS_BITNUM          4U
#define GDUDSLVL_GDSFHS_MASK            128U


/*** GDUPHL - GDU Phase Log Register; 0x000006AC ***/
typedef union {
  byte Byte;
  struct {
    byte GPHL        :3;                                       /* GDU Phase Log Bits */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} GDUPHLSTR;
extern volatile GDUPHLSTR _GDUPHL @0x000006AC;
#define GDUPHL                          _GDUPHL.Byte
#define GDUPHL_GPHL                     _GDUPHL.Bits.GPHL

#define GDUPHL_GPHL_MASK                7U
#define GDUPHL_GPHL_BITNUM              0U


/*** GDUCLK2 - GDU Clock Control Register 2; 0x000006AD ***/
typedef union {
  byte Byte;
  struct {
    byte GCPCD       :4;                                       /* GDU Charge Pump Clock Divider */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} GDUCLK2STR;
extern volatile GDUCLK2STR _GDUCLK2 @0x000006AD;
#define GDUCLK2                         _GDUCLK2.Byte
#define GDUCLK2_GCPCD                   _GDUCLK2.Bits.GCPCD

#define GDUCLK2_GCPCD_MASK              15U
#define GDUCLK2_GCPCD_BITNUM            0U


/*** GDUOC0 - GDU Overcurrent Register 0; 0x000006AE ***/
typedef union {
  byte Byte;
  struct {
    byte GOCT0       :5;                                       /* GDU Overcurrent Comparator Threshold */
    byte             :1; 
    byte GOCE0       :1;                                       /* GDU Overcurrent Comparator Enable */
    byte GOCA0       :1;                                       /* GDU Overcurrent Action */
  } Bits;
} GDUOC0STR;
extern volatile GDUOC0STR _GDUOC0 @0x000006AE;
#define GDUOC0                          _GDUOC0.Byte
#define GDUOC0_GOCT0                    _GDUOC0.Bits.GOCT0
#define GDUOC0_GOCE0                    _GDUOC0.Bits.GOCE0
#define GDUOC0_GOCA0                    _GDUOC0.Bits.GOCA0
/* GDUOC_ARR: Access 2 GDUOCx registers in an array */
#define GDUOC_ARR                       ((volatile byte *) &GDUOC0)

#define GDUOC0_GOCT0_MASK               31U
#define GDUOC0_GOCT0_BITNUM             0U
#define GDUOC0_GOCE0_MASK               64U
#define GDUOC0_GOCA0_MASK               128U


/*** GDUOC1 - GDU Overcurrent Register 1; 0x000006AF ***/
typedef union {
  byte Byte;
  struct {
    byte GOCT1       :5;                                       /* GDU Overcurrent Comparator Threshold */
    byte             :1; 
    byte GOCE1       :1;                                       /* GDU Overcurrent Comparator Enable */
    byte GOCA1       :1;                                       /* GDU Overcurrent Action */
  } Bits;
} GDUOC1STR;
