ClearDotX/TRK-KEA8_128/LINStack/Examples/S12ZVML31_example/Obidos_S12ZVML31/S12ZVML31_LIN_Master/Project_Headers/mc9s12zvml31.h
#define VectorNumber_VReserved46        This_symb_has_been_depreciated
#define VectorNumber_VReserved25        This_symb_has_been_depreciated
#define VReserved46                     This_symb_has_been_depreciated
#define VReserved25                     This_symb_has_been_depreciated
#define DBGC1_EEVE                      DBGC1_EEVE1
#define DBGC1_EEVE_MASK                 DBGC1_EEVE1_MASK
#define DBGC1_EEVE_BITNUM               This_symb_has_been_depreciated
#define DBGC2_CDCM                      This_symb_has_been_depreciated
#define DBGC2_CDCM_MASK                 This_symb_has_been_depreciated
#define DBGC2_CDCM_BITNUM               This_symb_has_been_depreciated
#define DBGTCRH                         This_symb_has_been_depreciated
#define DBGTCRH_TALIGN                  This_symb_has_been_depreciated
#define DBGTCRH_TRCMOD                  This_symb_has_been_depreciated
#define DBGTCRH_TRANGE                  This_symb_has_been_depreciated
#define DBGTCRH_TSOURCE                 This_symb_has_been_depreciated
#define DBGTCRH_TALIGN_MASK             This_symb_has_been_depreciated
#define DBGTCRH_TALIGN_BITNUM           This_symb_has_been_depreciated
#define DBGTCRH_TRCMOD_MASK             This_symb_has_been_depreciated
#define DBGTCRH_TRCMOD_BITNUM           This_symb_has_been_depreciated
#define DBGTCRH_TRANGE_MASK             This_symb_has_been_depreciated
#define DBGTCRH_TRANGE_BITNUM           This_symb_has_been_depreciated
#define DBGTCRH_TSOURCE_MASK            This_symb_has_been_depreciated
#define DBGTCRL                         This_symb_has_been_depreciated
#define DBGTCRL_STAMP                   This_symb_has_been_depreciated
#define DBGTCRL_PROFILE                 This_symb_has_been_depreciated
#define DBGTCRL_PDOE                    This_symb_has_been_depreciated
#define DBGTCRL_DSTAMP                  This_symb_has_been_depreciated
#define DBGTCRL_STAMP_MASK              This_symb_has_been_depreciated
#define DBGTCRL_PROFILE_MASK            This_symb_has_been_depreciated
#define DBGTCRL_PDOE_MASK               This_symb_has_been_depreciated
#define DBGTCRL_DSTAMP_MASK             This_symb_has_been_depreciated
#define DBGTB                           This_symb_has_been_depreciated
#define DBGTB_BIT0                      This_symb_has_been_depreciated
#define DBGTB_BIT1                      This_symb_has_been_depreciated
#define DBGTB_BIT2                      This_symb_has_been_depreciated
#define DBGTB_BIT3                      This_symb_has_been_depreciated
#define DBGTB_BIT4                      This_symb_has_been_depreciated
#define DBGTB_BIT5                      This_symb_has_been_depreciated
#define DBGTB_BIT6                      This_symb_has_been_depreciated
#define DBGTB_BIT7                      This_symb_has_been_depreciated
#define DBGTB_BIT8                      This_symb_has_been_depreciated
#define DBGTB_BIT9                      This_symb_has_been_depreciated
#define DBGTB_BIT10                     This_symb_has_been_depreciated
#define DBGTB_BIT11                     This_symb_has_been_depreciated
#define DBGTB_BIT12                     This_symb_has_been_depreciated
#define DBGTB_BIT13                     This_symb_has_been_depreciated
#define DBGTB_BIT14                     This_symb_has_been_depreciated
#define DBGTB_BIT15                     This_symb_has_been_depreciated
#define DBGTB_BIT0_MASK                 This_symb_has_been_depreciated
#define DBGTB_BIT1_MASK                 This_symb_has_been_depreciated
#define DBGTB_BIT2_MASK                 This_symb_has_been_depreciated
#define DBGTB_BIT3_MASK                 This_symb_has_been_depreciated
#define DBGTB_BIT4_MASK                 This_symb_has_been_depreciated
#define DBGTB_BIT5_MASK                 This_symb_has_been_depreciated
#define DBGTB_BIT6_MASK                 This_symb_has_been_depreciated
#define DBGTB_BIT7_MASK                 This_symb_has_been_depreciated
#define DBGTB_BIT8_MASK                 This_symb_has_been_depreciated
#define DBGTB_BIT9_MASK                 This_symb_has_been_depreciated
#define DBGTB_BIT10_MASK                This_symb_has_been_depreciated
#define DBGTB_BIT11_MASK                This_symb_has_been_depreciated
#define DBGTB_BIT12_MASK                This_symb_has_been_depreciated
#define DBGTB_BIT13_MASK                This_symb_has_been_depreciated
#define DBGTB_BIT14_MASK                This_symb_has_been_depreciated
#define DBGTB_BIT15_MASK                This_symb_has_been_depreciated
#define DBGCNT                          This_symb_has_been_depreciated
#define DBGCNT_CNT                      This_symb_has_been_depreciated
#define DBGCNT_CNT_MASK                 This_symb_has_been_depreciated
#define DBGCNT_CNT_BITNUM               This_symb_has_been_depreciated
#define DBGSCR1_C2SC                    This_symb_has_been_depreciated
#define DBGSCR1_C2SC_MASK               This_symb_has_been_depreciated
#define DBGSCR1_C2SC_BITNUM             This_symb_has_been_depreciated
#define DBGSCR2_C2SC                    This_symb_has_been_depreciated
#define DBGSCR2_C2SC_MASK               This_symb_has_been_depreciated
#define DBGSCR2_C2SC_BITNUM             This_symb_has_been_depreciated
#define DBGSCR3_C2SC                    This_symb_has_been_depreciated
#define DBGSCR3_C2SC_MASK               This_symb_has_been_depreciated
#define DBGSCR3_C2SC_BITNUM             This_symb_has_been_depreciated
#define DBGEFR_ME2                      This_symb_has_been_depreciated
#define DBGEFR_PTBOVF                   This_symb_has_been_depreciated
#define DBGEFR_ME2_MASK                 This_symb_has_been_depreciated
#define DBGEFR_PTBOVF_MASK              This_symb_has_been_depreciated
#define DBGSR_PTACT                     This_symb_has_been_depreciated
#define DBGSR_TBF                       This_symb_has_been_depreciated
#define DBGSR_PTACT_MASK                This_symb_has_been_depreciated
#define DBGSR_TBF_MASK                  This_symb_has_been_depreciated
#define DBGCCTL                         This_symb_has_been_depreciated
#define DBGCCTL_COMPE                   This_symb_has_been_depreciated
#define DBGCCTL_RWE                     This_symb_has_been_depreciated
#define DBGCCTL_RW                      This_symb_has_been_depreciated
#define DBGCCTL_INST                    This_symb_has_been_depreciated
#define DBGCCTL_NDB                     This_symb_has_been_depreciated
#define DBGCCTL_COMPE_MASK              This_symb_has_been_depreciated
#define DBGCCTL_RWE_MASK                This_symb_has_been_depreciated
#define DBGCCTL_RW_MASK                 This_symb_has_been_depreciated
#define DBGCCTL_INST_MASK               This_symb_has_been_depreciated
#define DBGCCTL_NDB_MASK                This_symb_has_been_depreciated
#define DBGCAH                          This_symb_has_been_depreciated
#define DBGCAH_DBGCA                    This_symb_has_been_depreciated
#define DBGCAH_DBGCA_MASK               This_symb_has_been_depreciated
#define DBGCAH_DBGCA_BITNUM             This_symb_has_been_depreciated
#define DBGCAM                          This_symb_has_been_depreciated
#define DBGCAM_DBGCA                    This_symb_has_been_depreciated
#define DBGCAM_DBGCA_MASK               This_symb_has_been_depreciated
#define DBGCAM_DBGCA_BITNUM             This_symb_has_been_depreciated
#define DBGCAL                          This_symb_has_been_depreciated
#define DBGCAL_DBGCA                    This_symb_has_been_depreciated
#define DBGCAL_DBGCA_MASK               This_symb_has_been_depreciated
#define DBGCAL_DBGCA_BITNUM             This_symb_has_been_depreciated
#define DBGCD0                          This_symb_has_been_depreciated
#define DBGCD0_BIT24                    This_symb_has_been_depreciated
#define DBGCD0_BIT25                    This_symb_has_been_depreciated
#define DBGCD0_BIT26                    This_symb_has_been_depreciated
#define DBGCD0_BIT27                    This_symb_has_been_depreciated
#define DBGCD0_BIT28                    This_symb_has_been_depreciated
#define DBGCD0_BIT29                    This_symb_has_been_depreciated
#define DBGCD0_BIT30                    This_symb_has_been_depreciated
#define DBGCD0_BIT31                    This_symb_has_been_depreciated
#define DBGCD_ARR                       This_symb_has_been_depreciated
#define DBGCD0_BIT24_MASK               This_symb_has_been_depreciated
#define DBGCD0_BIT25_MASK               This_symb_has_been_depreciated
#define DBGCD0_BIT26_MASK               This_symb_has_been_depreciated
#define DBGCD0_BIT27_MASK               This_symb_has_been_depreciated
#define DBGCD0_BIT28_MASK               This_symb_has_been_depreciated
#define DBGCD0_BIT29_MASK               This_symb_has_been_depreciated
#define DBGCD0_BIT30_MASK               This_symb_has_been_depreciated
#define DBGCD0_BIT31_MASK               This_symb_has_been_depreciated
#define DBGCD1                          This_symb_has_been_depreciated
#define DBGCD1_BIT16                    This_symb_has_been_depreciated
#define DBGCD1_BIT17                    This_symb_has_been_depreciated
#define DBGCD1_BIT18                    This_symb_has_been_depreciated
#define DBGCD1_BIT19                    This_symb_has_been_depreciated
#define DBGCD1_BIT20                    This_symb_has_been_depreciated
#define DBGCD1_BIT21                    This_symb_has_been_depreciated
#define DBGCD1_BIT22                    This_symb_has_been_depreciated
#define DBGCD1_BIT23                    This_symb_has_been_depreciated
#define DBGCD1_BIT16_MASK               This_symb_has_been_depreciated
#define DBGCD1_BIT17_MASK               This_symb_has_been_depreciated
#define DBGCD1_BIT18_MASK               This_symb_has_been_depreciated
#define DBGCD1_BIT19_MASK               This_symb_has_been_depreciated
#define DBGCD1_BIT20_MASK               This_symb_has_been_depreciated
#define DBGCD1_BIT21_MASK               This_symb_has_been_depreciated
#define DBGCD1_BIT22_MASK               This_symb_has_been_depreciated
#define DBGCD1_BIT23_MASK               This_symb_has_been_depreciated
#define DBGCD2                          This_symb_has_been_depreciated
#define DBGCD2_BIT8                     This_symb_has_been_depreciated
#define DBGCD2_BIT9                     This_symb_has_been_depreciated
#define DBGCD2_BIT10                    This_symb_has_been_depreciated
#define DBGCD2_BIT11                    This_symb_has_been_depreciated
#define DBGCD2_BIT12                    This_symb_has_been_depreciated
#define DBGCD2_BIT13                    This_symb_has_been_depreciated
#define DBGCD2_BIT14                    This_symb_has_been_depreciated
#define DBGCD2_BIT15                    This_symb_has_been_depreciated
#define DBGCD2_BIT8_MASK                This_symb_has_been_depreciated
#define DBGCD2_BIT9_MASK                This_symb_has_been_depreciated
#define DBGCD2_BIT10_MASK               This_symb_has_been_depreciated
#define DBGCD2_BIT11_MASK               This_symb_has_been_depreciated
#define DBGCD2_BIT12_MASK               This_symb_has_been_depreciated
#define DBGCD2_BIT13_MASK               This_symb_has_been_depreciated
#define DBGCD2_BIT14_MASK               This_symb_has_been_depreciated
#define DBGCD2_BIT15_MASK               This_symb_has_been_depreciated
#define DBGCD3                          This_symb_has_been_depreciated
#define DBGCD3_BIT0                     This_symb_has_been_depreciated
#define DBGCD3_BIT1                     This_symb_has_been_depreciated
#define DBGCD3_BIT2                     This_symb_has_been_depreciated
#define DBGCD3_BIT3                     This_symb_has_been_depreciated
#define DBGCD3_BIT4                     This_symb_has_been_depreciated
#define DBGCD3_BIT5                     This_symb_has_been_depreciated
#define DBGCD3_BIT6                     This_symb_has_been_depreciated
#define DBGCD3_BIT7                     This_symb_has_been_depreciated
#define DBGCD3_BIT0_MASK                This_symb_has_been_depreciated
#define DBGCD3_BIT1_MASK                This_symb_has_been_depreciated
#define DBGCD3_BIT2_MASK                This_symb_has_been_depreciated
#define DBGCD3_BIT3_MASK                This_symb_has_been_depreciated
#define DBGCD3_BIT4_MASK                This_symb_has_been_depreciated
#define DBGCD3_BIT5_MASK                This_symb_has_been_depreciated
#define DBGCD3_BIT6_MASK                This_symb_has_been_depreciated
#define DBGCD3_BIT7_MASK                This_symb_has_been_depreciated
#define DBGCDM0                         This_symb_has_been_depreciated
#define DBGCDM0_BIT24                   This_symb_has_been_depreciated
#define DBGCDM0_BIT25                   This_symb_has_been_depreciated
#define DBGCDM0_BIT26                   This_symb_has_been_depreciated
#define DBGCDM0_BIT27                   This_symb_has_been_depreciated
#define DBGCDM0_BIT28                   This_symb_has_been_depreciated
#define DBGCDM0_BIT29                   This_symb_has_been_depreciated
#define DBGCDM0_BIT30                   This_symb_has_been_depreciated
#define DBGCDM0_BIT31                   This_symb_has_been_depreciated
#define DBGCDM_ARR                      This_symb_has_been_depreciated
#define DBGCDM0_BIT24_MASK              This_symb_has_been_depreciated
#define DBGCDM0_BIT25_MASK              This_symb_has_been_depreciated
#define DBGCDM0_BIT26_MASK              This_symb_has_been_depreciated
#define DBGCDM0_BIT27_MASK              This_symb_has_been_depreciated
#define DBGCDM0_BIT28_MASK              This_symb_has_been_depreciated
#define DBGCDM0_BIT29_MASK              This_symb_has_been_depreciated
#define DBGCDM0_BIT30_MASK              This_symb_has_been_depreciated
#define DBGCDM0_BIT31_MASK              This_symb_has_been_depreciated
#define DBGCDM1                         This_symb_has_been_depreciated
#define DBGCDM1_BIT16                   This_symb_has_been_depreciated
#define DBGCDM1_BIT17                   This_symb_has_been_depreciated
#define DBGCDM1_BIT18                   This_symb_has_been_depreciated
#define DBGCDM1_BIT19                   This_symb_has_been_depreciated
#define DBGCDM1_BIT20                   This_symb_has_been_depreciated
#define DBGCDM1_BIT21                   This_symb_has_been_depreciated
#define DBGCDM1_BIT22                   This_symb_has_been_depreciated
#define DBGCDM1_BIT23                   This_symb_has_been_depreciated
#define DBGCDM1_BIT16_MASK              This_symb_has_been_depreciated
#define DBGCDM1_BIT17_MASK              This_symb_has_been_depreciated
#define DBGCDM1_BIT18_MASK              This_symb_has_been_depreciated
#define DBGCDM1_BIT19_MASK              This_symb_has_been_depreciated
#define DBGCDM1_BIT20_MASK              This_symb_has_been_depreciated
#define DBGCDM1_BIT21_MASK              This_symb_has_been_depreciated
#define DBGCDM1_BIT22_MASK              This_symb_has_been_depreciated
#define DBGCDM1_BIT23_MASK              This_symb_has_been_depreciated
#define DBGCDM2                         This_symb_has_been_depreciated
#define DBGCDM2_BIT8                    This_symb_has_been_depreciated
#define DBGCDM2_BIT9                    This_symb_has_been_depreciated
#define DBGCDM2_BIT10                   This_symb_has_been_depreciated
#define DBGCDM2_BIT11                   This_symb_has_been_depreciated
#define DBGCDM2_BIT12                   This_symb_has_been_depreciated
#define DBGCDM2_BIT13                   This_symb_has_been_depreciated
#define DBGCDM2_BIT14                   This_symb_has_been_depreciated
#define DBGCDM2_BIT15                   This_symb_has_been_depreciated
#define DBGCDM2_BIT8_MASK               This_symb_has_been_depreciated
#define DBGCDM2_BIT9_MASK               This_symb_has_been_depreciated
#define DBGCDM2_BIT10_MASK              This_symb_has_been_depreciated
#define DBGCDM2_BIT11_MASK              This_symb_has_been_depreciated
#define DBGCDM2_BIT12_MASK              This_symb_has_been_depreciated
#define DBGCDM2_BIT13_MASK              This_symb_has_been_depreciated
#define DBGCDM2_BIT14_MASK              This_symb_has_been_depreciated
#define DBGCDM2_BIT15_MASK              This_symb_has_been_depreciated
#define DBGCDM3                         This_symb_has_been_depreciated
#define DBGCDM3_BIT0                    This_symb_has_been_depreciated
#define DBGCDM3_BIT1                    This_symb_has_been_depreciated
#define DBGCDM3_BIT2                    This_symb_has_been_depreciated
#define DBGCDM3_BIT3                    This_symb_has_been_depreciated
#define DBGCDM3_BIT4                    This_symb_has_been_depreciated
#define DBGCDM3_BIT5                    This_symb_has_been_depreciated
#define DBGCDM3_BIT6                    This_symb_has_been_depreciated
#define DBGCDM3_BIT7                    This_symb_has_been_depreciated
#define DBGCDM3_BIT0_MASK               This_symb_has_been_depreciated
#define DBGCDM3_BIT1_MASK               This_symb_has_been_depreciated
#define DBGCDM3_BIT2_MASK               This_symb_has_been_depreciated
#define DBGCDM3_BIT3_MASK               This_symb_has_been_depreciated
#define DBGCDM3_BIT4_MASK               This_symb_has_been_depreciated
#define DBGCDM3_BIT5_MASK               This_symb_has_been_depreciated
#define DBGCDM3_BIT6_MASK               This_symb_has_been_depreciated
#define DBGCDM3_BIT7_MASK               This_symb_has_been_depreciated

/*lint -restore  +esym(960,18.4) +esym(961,19.7) Enable MISRA rule (1.1,18.4,6.4,19.7) checking. */
#endif
